packages/server/__fixtures__/stripe-responses/stripe-invoice.json

{
  "id": "cs_test_b1ivPCgLqac9579vcoVAjyefRzOzbvjhNN8IstESJr0Ycr8xvm1PBI2uqg",
  "object": "checkout.session",
  "adaptive_pricing": null,
  "after_expiration": null,
  "allow_promotion_codes": null,
  "amount_subtotal": 11500,
  "amount_total": 11500,
  "automatic_tax": {
    "enabled": false,
    "liability": null,
    "status": null
  },
  "billing_address_collection": null,
  "cancel_url": null,
  "client_reference_id": null,
  "client_secret": null,
  "collected_information": {
    "shipping_details": null
  },
  "consent": null,
  "consent_collection": null,
  "created": 1742467750,
  "currency": "eur",
  "currency_conversion": null,
  "custom_fields": [],
  "custom_text": {
    "after_submit": null,
    "shipping_address": null,
    "submit": null,
    "terms_of_service_acceptance": null
  },
  "customer": "cus_RydwphZezwTVAI",
  "customer_creation": null,
  "customer_details": {
    "address": null,
    "email": "test+test_mode@test.test",
    "name": null,
    "phone": null,
    "tax_exempt": "none",
    "tax_ids": null
  },
  "customer_email": null,
  "discounts": [],
  "expires_at": 1742554150,
  "invoice": null,
  "invoice_creation": null,
  "livemode": false,
  "locale": "auto",
  "metadata": {
    "id": "1",
    "initial": "true"
  },
  "mode": "subscription",
  "payment_intent": null,
  "payment_link": null,
  "payment_method_collection": "always",
  "payment_method_configuration_details": null,
  "payment_method_options": {
    "card": {
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": ["sepa_debit", "card"],
  "payment_status": "unpaid",
  "permissions": null,
  "phone_number_collection": {
    "enabled": false
  },
  "recovered_from": null,
  "saved_payment_method_options": {
    "allow_redisplay_filters": ["always"],
    "payment_method_remove": null,
    "payment_method_save": null
  },
  "setup_intent": null,
  "shipping_address_collection": null,
  "shipping_cost": null,
  "shipping_details": null,
  "shipping_options": [],
  "status": "open",
  "submit_type": null,
  "subscription": null,
  "success_url": "http://localhost:9999/en/organizations/undefined/subscriptions/success/basic",
  "total_details": {
    "amount_discount": 0,
    "amount_shipping": 0,
    "amount_tax": 0
  },
  "ui_mode": "hosted",
  "url": "https://checkout.stripe.com/c/pay/cs_test_b1ivPCgLqac9579vcoVAjyefRzOzbvjhNN8IstESJr0Ycr8xvm1PBI2uqg#fidpamZkaWAnPydkcHFqJyknZHVsTmB8Jz8ndW5acWB2cVowNFRObTBQTHRLblxta0ZKRGxqbjR8aj1jVWhQR3Zhc29BUXRBNEZfbzBiPHBtfVdLNWJxVmtARzF9XENLcVdxajczdzNndG9AN2dha1d9T3NERlJhfXZ3UzU1Xz0wajBJbUMnKSdjd2poVmB3c2B3Jz9xd3BgKSdpZHxqcHFRfHVgJz8naHBpcWxabHFgaCcpJ2BrZGdpYFVpZGZgbWppYWB3dic%2FcXdwYHgl"
}
